src/templates/v201809/userListClient.xml.twig

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <RequestHeader xmlns="https://ddp.googleapis.com/api/ddp/provider/v201809">
            <clientCustomerId>{{ clientCustomerId }}</clientCustomerId>
        </RequestHeader>
    </S:Header>
    <S:Body>
        <mutate xmlns="https://ddp.googleapis.com/api/ddp/provider/v201809">
            <operations>
                <operator>{{ operator }}</operator>
                <operand xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:type="UserListClient">
                    <userListId>{{ userlistid }}</userListId>
                    <status>{{ status }}</status>
                    {% if pricingInfo is defined %}
                        <pricingInfo>
                            <currencyCodeString>{{ pricingInfo.currencycodestring }}</currencyCodeString>
                            <userListCost>{{ pricingInfo.userlistcost }}</userListCost>
                            <costType>{{ pricingInfo.costtype }}</costType>
                            <saleType>{{ pricingInfo.saletype }}</saleType>
                            <approvalState>{{ pricingInfo.approvalstate }}</approvalState>
                        </pricingInfo>
                    {% endif %}
                    {% if clientproduct is defined %}<clientProduct>{{ clientproduct }}</clientProduct>{% endif %}
                    <clientId>{{ clientid }}</clientId>
                </operand>
            </operations>
        </mutate>
    </S:Body>
</S:Envelope>
